k6/m7g.large.txt
❯ BASE_URL="http://url-shortener-test-lb-1267944462.eu-central-1.elb.amazonaws.com" k6 run script.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 5m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration{name:GetRedirectLink}
    ✗ 'p(95)<100' p(95)=277.42ms

    http_req_duration{name:PostCreateLink}
    ✓ 'p(95)<400' p(95)=353.82ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.12%


  █ TOTAL RESULTS 

    checks_total.......: 1257250 4190.186053/s
    checks_succeeded...: 99.88%  1255761 out of 1257250
    checks_failed......: 0.11%   1489 out of 1257250

    ✗ POST link created (200)
      ↳  99% — ✓ 418861 / ✗ 667
    ✗ GET short link received (302)
      ↳  99% — ✓ 418450 / ✗ 411
    ✗ Redirect location is Google
      ↳  99% — ✓ 418450 / ✗ 411

    HTTP
    http_req_duration..............: avg=183.88ms min=29.51ms  med=137.91ms max=30.25s   p(90)=308.68ms p(95)=334.01ms
      { expected_response:true }...: avg=163.98ms min=29.51ms  med=137.76ms max=878.26ms p(90)=308.44ms p(95)=333.57ms
      { name:GetRedirectLink }.....: avg=143.21ms min=29.51ms  med=106.03ms max=30.19s   p(90)=241.75ms p(95)=277.42ms
      { name:PostCreateLink }......: avg=224.48ms min=33.67ms  med=204.34ms max=30.25s   p(90)=330.17ms p(95)=353.82ms
    http_req_failed................: 0.12%  1078 out of 838389
    http_reqs......................: 838389 2794.198365/s

    EXECUTION
    iteration_duration.............: avg=418.43ms min=119.06ms med=421.81ms max=30.47s   p(90)=527.26ms p(95)=559.14ms
    iterations.....................: 419528 1398.210677/s
    vus............................: 7      min=3              max=999 
    vus_max........................: 1000   min=1000           max=1000

    NETWORK
    data_received..................: 157 MB 522 kB/s
    data_sent......................: 146 MB 488 kB/s



running (5m00.0s), 0000/1000 VUs, 419528 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  5m0s
ERRO[0300] thresholds on metrics 'http_req_duration{name:GetRedirectLink}' have been crossed