k6/t4g.medium.txt
❯ BASE_URL="http://url-shortener-test-lb-423876123.eu-central-1.elb.amazonaws.com" k6 run script.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 4m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=674.78ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 582534  2426.04471/s
    checks_succeeded...: 100.00% 582534 out of 582534
    checks_failed......: 0.00%   0 out of 582534

    ✓ POST link created (200)
    ✓ GET short link received (302)
    ✓ Redirect location is Google

    HTTP
    http_req_duration..............: avg=295.67ms min=29.34ms  med=267.93ms max=1.92s p(90)=550.9ms p(95)=674.78ms
      { expected_response:true }...: avg=295.67ms min=29.34ms  med=267.93ms max=1.92s p(90)=550.9ms p(95)=674.78ms
    http_req_failed................: 0.00%  0 out of 388356
    http_reqs......................: 388356 1617.36314/s

    EXECUTION
    iteration_duration.............: avg=642.38ms min=122.13ms med=605.85ms max=2.5s  p(90)=1.15s   p(95)=1.32s   
    iterations.....................: 194178 808.68157/s
    vus............................: 7      min=3           max=999 
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 73 MB  302 kB/s
    data_sent......................: 67 MB  281 kB/s



running (4m00.1s), 0000/1000 VUs, 194178 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  4m0s
ERRO[0240] thresholds on metrics 'http_req_duration' have been crossed